---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpotElevSingleOrUpperPrefix
source: html/8571700d-c42b-d30d-d3b1-ca8f783c070f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpotElevSingleOrUpperPrefix Property

"Single/Upper Value Prefix"

## Syntax (C#)
```csharp
public static ForgeTypeId SpotElevSingleOrUpperPrefix { get; }
```